spec/support/vcr_cassettes/claims_api/bgs/tracked_item_service/find_tracked_items.yml

---
http_interactions:
- request:
    method: post
    uri: "<BGS_BASE_URL>/TrackedItemService/TrackedItemService"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://services.mapd.benefits.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>127.0.0.1</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:findTrackedItems><claimId>600118544</claimId>
        </tns:findTrackedItems>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - "<FARADAY_VERSION>"
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"findTrackedItems"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 23 Jan 2025 16:04:02 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdJABF3ZWJsb2dpYy5hcHAubWFwZAAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABzEuMTcuODgAAA==</work:WorkContext></env:Header><S:Body><ns0:findTrackedItemsResponse
        xmlns:ns0="http://services.mapd.benefits.vba.va.gov/">
        <BenefitClaim><name>BenefitClaim</name><dvlpmtItems><jrnDt>2022-02-03T12:44:36-06:00</jrnDt><name>DevelopmentItem</name><claimId>600118544</claimId><createDt>2022-02-03T12:44:36-06:00</createDt><createPtcpntId>600310807</createPtcpntId><createStnNum>344</createStnNum><docid>874994</docid><dvlpmtItemId>325525</dvlpmtItemId><dvlpmtTc>CLMNTRQST</dvlpmtTc><reqDt>2022-02-04T00:00:00-06:00</reqDt><shortNm>MG-not
        a recognized condition</shortNm><stdDevactnId>42906</stdDevactnId><suspnsDt>2022-03-06T00:00:00-06:00</suspnsDt><vbmsDevactionId>182460029</vbmsDevactionId></dvlpmtItems>
        <dvlpmtItems><jrnDt>2022-02-03T12:44:36-06:00</jrnDt><name>DevelopmentItem</name><claimId>600118544</claimId><createDt>2022-02-03T12:44:36-06:00</createDt><createPtcpntId>600310807</createPtcpntId><createStnNum>344</createStnNum><docid>874994</docid><dvlpmtItemId>325524</dvlpmtItemId><dvlpmtTc>CLMNTRQST</dvlpmtTc><reqDt>2022-02-04T00:00:00-06:00</reqDt><shortNm>Line
        of Duty determination from claimant</shortNm><stdDevactnId>42908</stdDevactnId><suspnsDt>2022-03-06T00:00:00-06:00</suspnsDt><vbmsDevactionId>182460028</vbmsDevactionId></dvlpmtItems>
                </BenefitClaim></ns0:findTrackedItemsResponse></S:Body></S:Envelope>
  recorded_at: Thu, 23 Jan 2025 16:04:06 GMT
recorded_with: VCR 6.3.1
